src/Reports/УДАЛИТЬСравнениеЗатратБУиНУ/УДАЛИТЬСравнениеЗатратБУиНУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>УДАЛИТЬСравнениеЗатратБУиНУ</name>
  <attributes>
    <name>ОбщийОтчет</name>
    <type>
      <types>ReportObject.ОтчетСписокКроссТаблица</types>
    </type>
  </attributes>
</mdclass:Report>

src/AccumulationRegisters/ЗатратыБухгалтерскийУчет/ЗатратыБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСВходящий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСКредит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СписаниеПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийЗатраты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначениеПоФакту</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/БракВПроизводствеБухгалтерскийУчет/БракВПроизводствеБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БракВПроизводствеБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСВходящий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСКредит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СписаниеПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийБракВПроизводстве</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначениеПоФакту</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияПродукции</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/НезавершенноеПроизводствоБухгалтерскийУчет/НезавершенноеПроизводствоБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НезавершенноеПроизводствоБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСВходящий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСКредит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийНезавершенноеПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПередела</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначениеПоФакту</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Затрата</name>
    <type>
      <types>EnumRef.ХарактерЗатрат</types>
      <types>CatalogRef.СпособыРаспределенияЗатратНаВыпуск</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаЗатраты</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияЗатраты</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НеУчитыватьВРасчетеБазы</name>
    <comment>Если Истина - движение приход не будет учитываться при расчете БазаПриход базы распределения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НеУчитыватьДвиженияПриРасчетеСебестоимости</name>
    <comment>Если Истина - движения приход/расход не будет учитываться в запросах при расчете себестоимости выпуска</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыЗатрат/ВидыЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗатрат</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Материальные</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаТруда</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОтчисленияНаСоциальныеНужды</name>
  </enumValues>
  <enumValues>
    <name>Амортизация</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Reports/УДАЛИТЬСравнениеЗатратБУиНУ/ObjectModule.bsl
#Если Клиент Тогда

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	СтруктураПредставлениеПолей = Новый Структура;
	МассивОтбора = Новый Массив;
	ОбщийОтчет.мСоответствиеНазначений = Новый Соответствие;
	ОбщийОтчет.мСтруктураДляОтбораПоКатегориям = Новый Структура;
	
	Текст = "ВЫБРАТЬ
	        |	ВложенныйЗапрос.РазделУчета,
	        |	ВложенныйЗапрос.Подразделение,
	        |	ВложенныйЗапрос.Подразделение.Владелец КАК Организация,
	        |	ВложенныйЗапрос.СтатьяЗатрат,
	        |	СУММА(ВложенныйЗапрос.СуммаБУПриход) КАК СуммаБУПриход,
	        |	СУММА(ВложенныйЗапрос.СуммаБУРасход) КАК СуммаБУРасход,
			|
			|	СУММА(ВложенныйЗапрос.СуммаНУПриход) КАК СуммаНУПриход,
	        |	СУММА(ВложенныйЗапрос.СуммаВРПриход) КАК СуммаВРПриход,
	        |	СУММА(ВложенныйЗапрос.СуммаНУПриход - ВложенныйЗапрос.СуммаВРПриход) КАК СуммаАмортизируемыхПриход,
	        |	СУММА(ВложенныйЗапрос.СуммаНеоблНУПриход) КАК СуммаНеоблНУПриход,
	        |	СУММА(ВложенныйЗапрос.СуммаНУРасход) КАК СуммаНУРасход,
	        |	СУММА(ВложенныйЗапрос.СуммаВРРасход) КАК СуммаВРРасход,
	        |	СУММА(ВложенныйЗапрос.СуммаНУРасход - ВложенныйЗапрос.СуммаВРРасход) КАК СуммаАмортизируемыхРасход,
	        |	СУММА(ВложенныйЗапрос.СуммаНеоблНУРасход) КАК СуммаНеоблНУРасход
	        |
	        |{ВЫБРАТЬ
	        |	ВложенныйЗапрос.Подразделение.*,
	        |	ВложенныйЗапрос.СтатьяЗатрат.*,
	        |	ВложенныйЗапрос.НоменклатурнаяГруппа.*,
	        |	ВложенныйЗапрос.Заказ.*,
			|	ВложенныйЗапрос.НалоговоеНазначение.*,
	        |	ВложенныйЗапрос.ВидДеятельностиНДС.*,
	        |	ВложенныйЗапрос.ВидНалоговойДеятельности.*,
	        |	ВложенныйЗапрос.Амортизируется.*
			|}
	        |
	        |ИЗ
	        |	(
			|	// ЗАТРАТЫ БУХГАЛТЕРСКИЕ
			|	ВЫБРАТЬ
	        |		""Затраты"" КАК РазделУчета,
	        |		ЗатратыБухгалтерскийУчет.Подразделение КАК Подразделение,
	        |		ЗатратыБухгалтерскийУчет.СтатьяЗатрат КАК СтатьяЗатрат,
	        |		ЗатратыБухгалтерскийУчет.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	        |		ЗатратыБухгалтерскийУчет.Заказ КАК Заказ,
			|		NULL КАК НалоговоеНазначение,
	        |		NULL КАК ВидДеятельностиНДС,
	        |		NULL КАК ВидНалоговойДеятельности,
	        |		NULL КАК Амортизируется,
			|		NULL КАК НалоговоеНазначениеПоФакту,
	        |		NULL КАК ВидДеятельностиНДСПоФакту,
	        |		NULL КАК ВидНалоговойДеятельностиПоФакту,
	        |		NULL КАК АмортизируетсяПоФакту,
	        |		ВЫБОР КОГДА ЗатратыБухгалтерскийУчет.ВидДвижения = &Приход ТОГДА ЗатратыБухгалтерскийУчет.Сумма ИНАЧЕ 0 КОНЕЦ КАК СуммаБУПриход,
	        |		ВЫБОР КОГДА ЗатратыБухгалтерскийУчет.ВидДвижения = &Расход ТОГДА ЗатратыБухгалтерскийУчет.Сумма ИНАЧЕ 0 КОНЕЦ КАК СуммаБУРасход,
	        |		NULL КАК СуммаНУПриход,
	        |		NULL КАК СуммаВРПриход,
	        |		NULL КАК СуммаНеоблНУПриход,
	        |		NULL КАК СуммаНУРасход,
	        |		NULL КАК СуммаВРРасход,
	        |		NULL КАК СуммаНеоблНУРасход
	        |	ИЗ
	        |		РегистрНакопления.ЗатратыБухгалтерскийУчет КАК ЗатратыБухгалтерскийУчет
			|	ГДЕ
			|		ЗатратыБухгалтерскийУчет.Активность = Истина
		    |		И ЗатратыБухгалтерскийУчет.Период >= &ДатаНач
		    |		И ((&ДатаКон = &ПустаяДата) ИЛИ (ЗатратыБухгалтерскийУчет.Период <= &ДатаКон))
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
			|	// ЗАТРАТЫ НАЛОГОВЫЕ
	        |	ВЫБРАТЬ
	        |		""Затраты"" КАК РазделУчета,
	        |		ЗатратыНалоговыйУчет.Подразделение,
	        |		ЗатратыНалоговыйУчет.СтатьяЗатрат,
	        |		ЗатратыНалоговыйУчет.НоменклатурнаяГруппа,
	        |		ЗатратыНалоговыйУчет.Заказ,
	        |		ЗатратыНалоговыйУчет.НалоговоеНазначение,
	        |		ЗатратыНалоговыйУчет.НалоговоеНазначение.ВидДеятельностиНДС,
	        |		ЗатратыНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности,
	        |		ЗатратыНалоговыйУчет.НалоговоеНазначение.Амортизируется,
			|		ЗатратыНалоговыйУчет.НалоговоеНазначениеПоФакту,
	        |		ЗатратыНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидДеятельностиНДС,
	        |		ЗатратыНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидНалоговойДеятельности,
	        |		ЗатратыНалоговыйУчет.НалоговоеНазначениеПоФакту.Амортизируется,
	        |		NULL,
	        |		NULL,
	        |		ВЫБОР КОГДА (ЗатратыНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности <> &Необлагаемая) И (ЗатратыНалоговыйУчет.ВидДвижения = &Приход) ТОГДА ЗатратыНалоговыйУчет.Сумма ИНАЧЕ 0 КОНЕЦ,
			|		ВЫБОР КОГДА (ЗатратыНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности <> &Необлагаемая) И (ЗатратыНалоговыйУчет.ВидДвижения = &Приход) ТОГДА ЗатратыНалоговыйУчет.СуммаВР ИНАЧЕ 0 КОНЕЦ,
	        |		ВЫБОР КОГДА (ЗатратыНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности = &Необлагаемая) И (ЗатратыНалоговыйУчет.ВидДвижения = &Приход) ТОГДА ЗатратыНалоговыйУчет.Сумма ИНАЧЕ 0 КОНЕЦ,
	        |		ВЫБОР КОГДА (ЗатратыНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидНалоговойДеятельности <> &Необлагаемая) И (ЗатратыНалоговыйУчет.ВидДвижения = &Расход) ТОГДА ЗатратыНалоговыйУчет.Сумма ИНАЧЕ 0 КОНЕЦ,
			|		ВЫБОР КОГДА (ЗатратыНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидНалоговойДеятельности <> &Необлагаемая) И (ЗатратыНалоговыйУчет.ВидДвижения = &Расход) И (НЕ ЗатратыНалоговыйУчет.НалоговоеНазначениеПоФакту.Амортизируется) ТОГДА ЗатратыНалоговыйУчет.Сумма ИНАЧЕ 0 КОНЕЦ,
	        |		ВЫБОР КОГДА (ЗатратыНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидНалоговойДеятельности = &Необлагаемая) И (ЗатратыНалоговыйУчет.ВидДвижения = &Расход) ТОГДА ЗатратыНалоговыйУчет.Сумма ИНАЧЕ 0 КОНЕЦ
	        |		
	        |	ИЗ
	        |		РегистрНакопления.ЗатратыНалоговыйУчет КАК ЗатратыНалоговыйУчет
			|	ГДЕ
			|		ЗатратыНалоговыйУчет.Активность = Истина
		    |		И ЗатратыНалоговыйУчет.Период >= &ДатаНач
		    |		И ((&ДатаКон = &ПустаяДата) ИЛИ (ЗатратыНалоговыйУчет.Период <= &ДатаКон))
			|
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
			|	// ЗАТРАТЫ НА БРАК БУХГАЛТЕРСКИЕ
			|	ВЫБРАТЬ
	        |		""Затраты на брак"" КАК РазделУчета,
	        |		БракВПроизводствеБухгалтерскийУчет.Подразделение КАК Подразделение,
	        |		БракВПроизводствеБухгалтерскийУчет.СтатьяЗатрат КАК СтатьяЗатрат,
	        |		БракВПроизводствеБухгалтерскийУчет.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	        |		БракВПроизводствеБухгалтерскийУчет.Заказ КАК Заказ,
			|		NULL КАК НалоговоеНазначение,
	        |		NULL КАК ВидДеятельностиНДС,
	        |		NULL КАК ВидНалоговойДеятельности,
	        |		NULL КАК Амортизируется,
			|		NULL КАК НалоговоеНазначениеПоФакту,
	        |		NULL КАК ВидДеятельностиНДСПоФакту,
	        |		NULL КАК ВидНалоговойДеятельностиПоФакту,
	        |		NULL КАК АмортизируетсяПоФакту,
	        |		ВЫБОР КОГДА БракВПроизводствеБухгалтерскийУчет.ВидДвижения = &Приход ТОГДА БракВПроизводствеБухгалтерскийУчет.Сумма ИНАЧЕ 0 КОНЕЦ КАК СуммаБУПриход,
	        |		ВЫБОР КОГДА БракВПроизводствеБухгалтерскийУчет.ВидДвижения = &Расход ТОГДА БракВПроизводствеБухгалтерскийУчет.Сумма ИНАЧЕ 0 КОНЕЦ КАК СуммаБУРасход,
	        |		NULL КАК СуммаНУПриход,
	        |		NULL КАК СуммаВРПриход,
	        |		NULL КАК СуммаНеоблНУПриход,
	        |		NULL КАК СуммаНУРасход,
	        |		NULL КАК СуммаВРРасход,
	        |		NULL КАК СуммаНеоблНУРасход
	        |	ИЗ
	        |		РегистрНакопления.БракВПроизводствеБухгалтерскийУчет КАК БракВПроизводствеБухгалтерскийУчет
			|	ГДЕ
			|		БракВПроизводствеБухгалтерскийУчет.Активность = Истина
		    |		И БракВПроизводствеБухгалтерскийУчет.Период >= &ДатаНач
		    |		И ((&ДатаКон = &ПустаяДата) ИЛИ (БракВПроизводствеБухгалтерскийУчет.Период <= &ДатаКон))
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
			|	// ЗАТРАТЫ НА БРАК НАЛОГОВЫЕ
	        |	ВЫБРАТЬ
	        |		""Затраты на брак"" КАК РазделУчета,
	        |		БракВПроизводствеНалоговыйУчет.Подразделение,
	        |		БракВПроизводствеНалоговыйУчет.СтатьяЗатрат,
	        |		БракВПроизводствеНалоговыйУчет.НоменклатурнаяГруппа,
	        |		БракВПроизводствеНалоговыйУчет.Заказ,
			|		БракВПроизводствеНалоговыйУчет.НалоговоеНазначение,
	        |		БракВПроизводствеНалоговыйУчет.НалоговоеНазначение.ВидДеятельностиНДС,
	        |		БракВПроизводствеНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности,
	        |		БракВПроизводствеНалоговыйУчет.НалоговоеНазначение.Амортизируется,
			|		БракВПроизводствеНалоговыйУчет.НалоговоеНазначениеПоФакту,
	        |		БракВПроизводствеНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидДеятельностиНДС,
	        |		БракВПроизводствеНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидНалоговойДеятельности,
	        |		БракВПроизводствеНалоговыйУчет.НалоговоеНазначениеПоФакту.Амортизируется,
	        |		NULL,
	        |		NULL,
	        |		ВЫБОР КОГДА (БракВПроизводствеНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности <> &Необлагаемая) И (БракВПроизводствеНалоговыйУчет.ВидДвижения = &Приход) ТОГДА БракВПроизводствеНалоговыйУчет.Сумма ИНАЧЕ 0 КОНЕЦ,
			|		ВЫБОР КОГДА (БракВПроизводствеНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности <> &Необлагаемая) И (БракВПроизводствеНалоговыйУчет.ВидДвижения = &Приход) ТОГДА БракВПроизводствеНалоговыйУчет.СуммаВР ИНАЧЕ 0 КОНЕЦ,
	        |		ВЫБОР КОГДА (БракВПроизводствеНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности = &Необлагаемая) И (БракВПроизводствеНалоговыйУчет.ВидДвижения = &Приход) ТОГДА БракВПроизводствеНалоговыйУчет.Сумма ИНАЧЕ 0 КОНЕЦ,
	        |		ВЫБОР КОГДА (БракВПроизводствеНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности <> &Необлагаемая) И (БракВПроизводствеНалоговыйУчет.ВидДвижения = &Расход) ТОГДА БракВПроизводствеНалоговыйУчет.Сумма ИНАЧЕ 0 КОНЕЦ,
			|		ВЫБОР КОГДА (БракВПроизводствеНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидНалоговойДеятельности <> &Необлагаемая) И (БракВПроизводствеНалоговыйУчет.ВидДвижения = &Расход) И (НЕ БракВПроизводствеНалоговыйУчет.НалоговоеНазначениеПоФакту.Амортизируется) ТОГДА БракВПроизводствеНалоговыйУчет.Сумма ИНАЧЕ 0 КОНЕЦ,
	        |		ВЫБОР КОГДА (БракВПроизводствеНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидНалоговойДеятельности = &Необлагаемая) И (БракВПроизводствеНалоговыйУчет.ВидДвижения = &Расход) ТОГДА БракВПроизводствеНалоговыйУчет.Сумма ИНАЧЕ 0 КОНЕЦ
	        |		
	        |	ИЗ
	        |		РегистрНакопления.БракВПроизводствеНалоговыйУчет КАК БракВПроизводствеНалоговыйУчет
			|	ГДЕ
			|		БракВПроизводствеНалоговыйУчет.Активность = Истина
		    |		И БракВПроизводствеНалоговыйУчет.Период >= &ДатаНач
		    |		И ((&ДатаКон = &ПустаяДата) ИЛИ (БракВПроизводствеНалоговыйУчет.Период <= &ДатаКон))
			|
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
			|	// НЕЗАВЕРШЕННОЕ ПРОИЗВОДСТВО БУХГАЛТЕРСКИЕ
			|	ВЫБРАТЬ
	        |		""Незавершенное производство"" КАК РазделУчета,
	        |		НезавершенноеПроизводствоБухгалтерскийУчет.Подразделение КАК Подразделение,
	        |		НезавершенноеПроизводствоБухгалтерскийУчет.СтатьяЗатрат КАК СтатьяЗатрат,
	        |		НезавершенноеПроизводствоБухгалтерскийУчет.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	        |		НезавершенноеПроизводствоБухгалтерскийУчет.Заказ КАК Заказ,
			|		NULL КАК НалоговоеНазначение,
	        |		NULL КАК ВидДеятельностиНДС,
	        |		NULL КАК ВидНалоговойДеятельности,
	        |		NULL КАК Амортизируется,
			|		NULL КАК НалоговоеНазначениеПоФакту,
	        |		NULL КАК ВидДеятельностиНДСПоФакту,
	        |		NULL КАК ВидНалоговойДеятельностиПоФакту,
	        |		NULL КАК АмортизируетсяПоФакту,
	        |		ВЫБОР КОГДА НезавершенноеПроизводствоБухгалтерскийУчет.ВидДвижения = &Приход ТОГДА НезавершенноеПроизводствоБухгалтерскийУчет.Стоимость ИНАЧЕ 0 КОНЕЦ КАК СуммаБУПриход,
	        |		ВЫБОР КОГДА НезавершенноеПроизводствоБухгалтерскийУчет.ВидДвижения = &Расход ТОГДА НезавершенноеПроизводствоБухгалтерскийУчет.Стоимость ИНАЧЕ 0 КОНЕЦ КАК СуммаБУРасход,
	        |		NULL КАК СуммаНУПриход,
	        |		NULL КАК СуммаВРПриход,
	        |		NULL КАК СуммаНеоблНУПриход,
	        |		NULL КАК СуммаНУРасход,
	        |		NULL КАК СуммаВРРасход,
	        |		NULL КАК СуммаНеоблНУРасход
	        |	ИЗ
	        |		РегистрНакопления.НезавершенноеПроизводствоБухгалтерскийУчет КАК НезавершенноеПроизводствоБухгалтерскийУчет
			|	ГДЕ
			|		НезавершенноеПроизводствоБухгалтерскийУчет.Активность = Истина
		    |		И НезавершенноеПроизводствоБухгалтерскийУчет.Период >= &ДатаНач
		    |		И ((&ДатаКон = &ПустаяДата) ИЛИ (НезавершенноеПроизводствоБухгалтерскийУчет.Период <= &ДатаКон))
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
			|	// НЕЗАВЕРШЕННОЕ ПРОИЗВОДСТВО НАЛОГОВЫЕ
	        |	ВЫБРАТЬ
	        |		""Незавершенное производство"" КАК РазделУчета,
	        |		НезавершенноеПроизводствоНалоговыйУчет.Подразделение,
	        |		НезавершенноеПроизводствоНалоговыйУчет.СтатьяЗатрат,
	        |		НезавершенноеПроизводствоНалоговыйУчет.НоменклатурнаяГруппа,
	        |		НезавершенноеПроизводствоНалоговыйУчет.Заказ,
			|		НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначение,
	        |		НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначение.ВидДеятельностиНДС,
	        |		НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности,
	        |		НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначение.Амортизируется,
			|		НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначениеПоФакту,
	        |		НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидДеятельностиНДС,
	        |		НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидНалоговойДеятельности,
	        |		НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначениеПоФакту.Амортизируется,
	        |		NULL,
	        |		NULL,
	        |		ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности <> &Необлагаемая) И (НезавершенноеПроизводствоНалоговыйУчет.ВидДвижения = &Приход) ТОГДА НезавершенноеПроизводствоНалоговыйУчет.Стоимость ИНАЧЕ 0 КОНЕЦ,
			|		ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности <> &Необлагаемая) И (НезавершенноеПроизводствоНалоговыйУчет.ВидДвижения = &Приход) ТОГДА НезавершенноеПроизводствоНалоговыйУчет.СуммаВР ИНАЧЕ 0 КОНЕЦ,
	        |		ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначение.ВидНалоговойДеятельности = &Необлагаемая) И (НезавершенноеПроизводствоНалоговыйУчет.ВидДвижения = &Приход) ТОГДА НезавершенноеПроизводствоНалоговыйУчет.Стоимость ИНАЧЕ 0 КОНЕЦ,
	        |		ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидНалоговойДеятельности <> &Необлагаемая) И (НезавершенноеПроизводствоНалоговыйУчет.ВидДвижения = &Расход) ТОГДА НезавершенноеПроизводствоНалоговыйУчет.Стоимость ИНАЧЕ 0 КОНЕЦ,
			|		ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидНалоговойДеятельности <> &Необлагаемая) И (НезавершенноеПроизводствоНалоговыйУчет.ВидДвижения = &Расход) И (НЕ НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначениеПоФакту.Амортизируется) ТОГДА НезавершенноеПроизводствоНалоговыйУчет.Стоимость ИНАЧЕ 0 КОНЕЦ,
	        |		ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчет.НалоговоеНазначениеПоФакту.ВидНалоговойДеятельности = &Необлагаемая) И (НезавершенноеПроизводствоНалоговыйУчет.ВидДвижения = &Расход) ТОГДА НезавершенноеПроизводствоНалоговыйУчет.Стоимость ИНАЧЕ 0 КОНЕЦ
	        |		
	        |	ИЗ
	        |		РегистрНакопления.НезавершенноеПроизводствоНалоговыйУчет КАК НезавершенноеПроизводствоНалоговыйУчет
			|	ГДЕ
			|		НезавершенноеПроизводствоНалоговыйУчет.Активность = Истина
		    |		И НезавершенноеПроизводствоНалоговыйУчет.Период >= &ДатаНач
		    |		И ((&ДатаКон = &ПустаяДата) ИЛИ (НезавершенноеПроизводствоНалоговыйУчет.Период <= &ДатаКон))
			|
			|) КАК ВложенныйЗапрос
	        |
	        |{ ГДЕ
	        |	ВложенныйЗапрос.Подразделение.* КАК Подразделение,
	        |	ВложенныйЗапрос.Подразделение.Владелец.* КАК Организация,
	        |	ВложенныйЗапрос.СтатьяЗатрат.* КАК СтатьяЗатрат,
	        |	ВложенныйЗапрос.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа,
	        |	ВложенныйЗапрос.Заказ.* КАК Заказ,
			|	ВложенныйЗапрос.НалоговоеНазначение.* КАК НалоговоеНазначение,
	        |	ВложенныйЗапрос.ВидДеятельностиНДС.* КАК ВидДеятельностиНДС,
	        |	ВложенныйЗапрос.ВидНалоговойДеятельности.* КАК ВидНалоговойДеятельности,
	        |	ВложенныйЗапрос.Амортизируется.* КАК Амортизируется,
			|	ВложенныйЗапрос.НалоговоеНазначениеПоФакту.* КАК НалоговоеНазначениеПоФакту,
	        |	ВложенныйЗапрос.ВидДеятельностиНДСПоФакту.* КАК ВидДеятельностиНДСПоФакту,
	        |	ВложенныйЗапрос.ВидНалоговойДеятельностиПоФакту.* КАК ВидНалоговойДеятельностиПоФакту,
	        |	ВложенныйЗапрос.АмортизируетсяПоФакту.* КАК АмортизируетсяПоФакту}
			|
	        |СГРУППИРОВАТЬ ПО
	        |	ВложенныйЗапрос.РазделУчета,
	        |	ВложенныйЗапрос.Подразделение,
	        |	ВложенныйЗапрос.СтатьяЗатрат,
	        |	ВложенныйЗапрос.НоменклатурнаяГруппа,
	        |	ВложенныйЗапрос.Заказ,
	        |	ВложенныйЗапрос.НалоговоеНазначение
	        |
			|{УПОРЯДОЧИТЬ ПО
	        |	ВложенныйЗапрос.Подразделение.*,
	        |	ВложенныйЗапрос.Подразделение.Владелец.*,
	        |	ВложенныйЗапрос.СтатьяЗатрат.*,
	        |	ВложенныйЗапрос.НоменклатурнаяГруппа.*,
	        |	ВложенныйЗапрос.Заказ.*,
			|	ВложенныйЗапрос.НалоговоеНазначение.*,
	        |	ВложенныйЗапрос.ВидДеятельностиНДС.*,
	        |	ВложенныйЗапрос.ВидНалоговойДеятельности.*,
	        |	ВложенныйЗапрос.Амортизируется.*,
			|	ВложенныйЗапрос.НалоговоеНазначениеПоФакту.*,
	        |	ВложенныйЗапрос.ВидДеятельностиНДСПоФакту.*,
	        |	ВложенныйЗапрос.ВидНалоговойДеятельностиПоФакту.*,
	        |	ВложенныйЗапрос.АмортизируетсяПоФакту.*
			|}
	        |
	        |ИТОГИ СУММА(СуммаБУПриход), СУММА(СуммаБУРасход), СУММА(СуммаНУПриход), СУММА(СуммаВРПриход), СУММА(СуммаАмортизируемыхПриход), СУММА(СуммаНеоблНУПриход), СУММА(СуммаНУРасход), СУММА(СуммаВРРасход), СУММА(СуммаАмортизируемыхРасход), СУММА(СуммаНеоблНУРасход) ПО
	        |	ВложенныйЗапрос.РазделУчета,
	        |	ВложенныйЗапрос.Подразделение,
	        |	ВложенныйЗапрос.СтатьяЗатрат,
			|	ОБЩИЕ
			|
			|{ИТОГИ ПО
	        |	ВложенныйЗапрос.РазделУчета.*,
	        |	ВложенныйЗапрос.Подразделение.*,
	        |	ВложенныйЗапрос.Подразделение.Владелец.*,
	        |	ВложенныйЗапрос.СтатьяЗатрат.*,
	        |	ВложенныйЗапрос.НоменклатурнаяГруппа.*,
	        |	ВложенныйЗапрос.Заказ.*,
			|	ВложенныйЗапрос.НалоговоеНазначение.*,
	        |	ВложенныйЗапрос.ВидДеятельностиНДС.*,
	        |	ВложенныйЗапрос.ВидНалоговойДеятельности.*,
	        |	ВложенныйЗапрос.Амортизируется.*,
			|	ВложенныйЗапрос.НалоговоеНазначениеПоФакту.*,
	        |	ВложенныйЗапрос.ВидДеятельностиНДСПоФакту.*,
	        |	ВложенныйЗапрос.ВидНалоговойДеятельностиПоФакту.*,
	        |	ВложенныйЗапрос.АмортизируетсяПоФакту.*
			|}
			|";
	
	СтруктураПредставлениеПолей = Новый Структура(
	"РазделУчета,
	|Подразделение,
	|Организация,
	|СтатьяЗатрат,
	|НоменклатурнаяГруппа,
	|Заказ,
	|НалоговоеНазначение,
	|ВидДеятельностиНДС,
	|ВидНалоговойДеятельности,
	|Амортизируется,
	|НалоговоеНазначениеПоФакту,
	|ВидДеятельностиНДСПоФакту,
	|ВидНалоговойДеятельностиПоФакту,
	|АмортизируетсяПоФакту",
	"Раздел учета",
	"Подразделение",
	"Организация",
	"Статья затрат",
	"Номенклатурная группа",
	"Заказ",
	"Налоговое назначение (предполагаемое при поступлении)",
	"Вид деят-сти НДС (предполагаемый при поступлении)",
	"Вид налог. деят-сти (предполагаемый при поступлении)",
	"Подлежит амортизации (предполагаемый при поступлении)",
	"Налоговое назначение (по факту списания)",
	"Вид деят-сти НДС (по факту списания)",
	"Вид налог. деят-сти (по факту списания)",
	"Подлежит амортизации (по факту списания)");
	
	ПостроительОтчета.Текст = Текст;
	
	// Бухгалтерские показатели
	Если ОбщийОтчет.Показатели.Найти("СуммаБУПриход", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СуммаБУПриход", "Поступление затрат (БУ)", истина, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("СуммаБУРасход", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СуммаБУРасход", "Списание затрат (БУ)", ложь, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	// Налоговые показатели
	Если ОбщийОтчет.Показатели.Найти("СуммаНУПриход", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СуммаНУПриход", "Поступление затрат (НУ)", истина, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("СуммаВРПриход", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СуммаВРПриход", "Поступление затрат, относящихся на вал. расх. (НУ)", ложь, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("СуммаАмортизируемыхПриход", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СуммаАмортизируемыхПриход", "Поступление затрат, подлежащих амортизации (НУ)", ложь, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("СуммаНеоблНУПриход", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СуммаНеоблНУПриход", "Поступление затрат, не учитываемых в НУ", истина, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("СуммаНУРасход", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СуммаНУРасход", "Списание затрат (НУ)", ложь, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("СуммаВРРасход", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СуммаВРРасход", "Списание затрат, относящихся на вал. расх. (НУ)", ложь, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("СуммаАмортизируемыхРасход", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СуммаАмортизируемыхРасход", "Списание затрат, подлежащих амортизации (НУ)", ложь, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("СуммаНеоблНУРасход", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("СуммаНеоблНУРасход", "Списание затрат, не учитываемых в НУ", ложь, "ЧЦ=15; ЧДЦ=3");
	КонецЕсли;
	
	ОбщийОтчет.мНазваниеОтчета = "Сравнение затрат по бухгалтерскому и налоговому учету";
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("СтатьяЗатрат.ВидЗатрат");
	МассивОтбора.Добавить("Организация");
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	// Отбор по умолчанию.
	// Исключаем амортизацию, потому что налоговая амортизация учитывается в совсем другом виде
	// и в регистры налоговых затрат не попадает.
	ЭлементОтбора = ОбщийОтчет.ПостроительОтчета.Отбор["СтатьяЗатратВидЗатрат"];
	ЭлементОтбора.ВидСравнения 	= ВидСравнения.НеРавно;
	ЭлементОтбора.Значение 		= Перечисления.ВидыЗатрат.Амортизация;
	ЭлементОтбора.Использование = Истина;
		
	ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения = Истина;
	
КонецПроцедуры

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь) Экспорт
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Необлагаемая",      	Справочники.ВидыНалоговойДеятельности.НеОблагаемая);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Расход",      			ВидДвиженияНакопления.Расход);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Приход",      			ВидДвиженияНакопления.Приход);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ПустаяДата",      		ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата")));
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПРоцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет=Неопределено) Экспорт
	
	// Если отчет, вызвавший порцедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры


#КонецЕсли
